In [2]:
from SQL_support_code import *
#https://github.com/DaveBackus/Data_Bootcamp/blob/master/Code/SQL/SQL_Intro.ipynb
#https://github.com/DaveBackus/Data_Bootcamp/blob/master/Code/SQL/SQL_Cheat_Sheet.pdf

#Selecting Data

In [28]:
run('''
    SELECT
        *
    FROM
        sales_table
        LIMIT 2
    ''')

      id  model_id  customer_id  revenue payment_type  salesman_id        date
0  54858        36       237906    21222      finance          276    1/7/2014
1  43161        20       967016    19140      finance          225   1/26/2014

#Unique/Distinct Values

In [29]:
run('''
    SELECT
        DISTINCT model_id
    FROM
        sales_table
        LIMIT 2
    ''')

   model_id
0        19
1        20

#Where Clause

=

<>

LIKE '...%'

In [5]:
run('''
    SELECT
        *
    FROM
        sales_table
    WHERE
        payment_type = 'cash'
        AND model_id = 46 
    ''')

      id  model_id  customer_id  revenue payment_type  salesman_id        date
0  40112        46       819010    14720         cash          147   1/17/2014
1  82630        46       618295    15040         cash          949   1/16/2014
2  70434        46       944843    13600         cash          680   1/25/2014
3  30046        46       982483    12640         cash          215   1/29/2014
4  14082        46       909110    15200         cash          813   1/28/2014
5  31815        46       743097    15040         cash          147   1/25/2014

In [6]:
run('''
    SELECT
        *
    FROM
        sales_table
    WHERE
        payment_type LIKE '%c%'
    LIMIT 5
    ''')

      id  model_id  customer_id  revenue payment_type  salesman_id        date
0  54858        36       237906    21222      finance          276    1/7/2014
1  43161        20       967016    19140      finance          225   1/26/2014
2  40112        46       819010    14720         cash          147   1/17/2014
3  92495        31       633030    19010      finance          215   1/13/2014
4  78000        51       341877    22022      finance          803   1/12/2014

#Order By

ORDER BY    '....'

LIMIT X

In [7]:
run('''
    SELECT
        *
    FROM
        sales_table
    ORDER BY
        revenue DESC
    LIMIT 2
    ''')

      id  model_id  customer_id  revenue payment_type  salesman_id        date
0  56245        36       248621    25938         cash          492   1/19/2014
1  37050        36       513614    25937         cash          492    1/2/2014

#Aliases

renameing columns with SQL query

In [8]:
run('''
    SELECT
        model_id AS Model_of_car,
        revenue AS Rev_per_car
    FROM 
        sales_table
        ORDER BY
        Model_of_car DESC
        LIMIT 10
         
    ''')

   Model_of_car  Rev_per_car
0            75        21409
1            75        18671
2            75        19418
3            75        19667
4            75        19418
5            75        19418
6            75        21409
7            75        22654
8            75        21409
9            75        22405





#Joins

Start by Joining SALEs_TABLE and CAR_TABLE

####These are inner joins

In [9]:
run('''
    SELECT
        *
    FROM
        sales_table
    LIMIT 1
    ''')

      id  model_id  customer_id  revenue payment_type  salesman_id       date
0  54858        36       237906    21222      finance          276   1/7/2014

In [10]:
run('''
    SELECT
        *
    FROM
        car_table
    LIMIT 1
    ''')

   model_id    make  model  sticker_price   cogs
0        20  Toyota  Camry          22000  13200

In [11]:

run('''
    SELECT
        *
    FROM
        sales_table
        JOIN car_table ON sales_table.model_id = car_table.model_id
    LIMIT 1
    ''')

,id,model_id,customer_id,revenue,payment_type,salesman_id,date,model_id,make,model,sticker_price,cogs
0,54858,36,237906,21222,finance,276,1/7/2014,36,Toyota,Tundra,26200,15720

###Joins are easier with Aliases :)

In [12]:
run('''
    SELECT
        S.customer_id,
        C.gender,
        S.revenue
    FROM
        sales_table AS S
        JOIN cust_table AS C on S.customer_id = C.customer_id
        LIMIT 3
    ''')

   customer_id  gender  revenue
0       237906  female    21222
1       967016    male    19140
2       819010    male    14720

#Types of Joins

In [13]:
run('''
    SELECT 
        *
    FROM
        Dog_Table
        LIMIT 1
        
    ''')

         Owner_Name   Dog_Name
0  Michael Martinez  Chewbacca

In [14]:
run('''
    SELECT 
        *
    FROM
        Cat_Table
        LIMIT 1
        
    ''')

         Owner_Name   Cat_Name
0  Michael Martinez  Mrs. Paws

##1) Inner Join

In [15]:
run('''
    SELECT
        S.Owner_Name,
        S.Dog_Name,
        C.Cat_Name
    FROM
        Dog_Table AS S
        JOIN Cat_Table AS C on S.Owner_Name = C.Owner_Name
        
    ''')

         Owner_Name   Dog_Name    Cat_Name
0  Michael Martinez  Chewbacca   Mrs. Paws
1    Gilbert Henkel        Max     Mittens
2        May Reeves    Georgie      Clover
3  Elizabeth Minier      Sunny  Sweetcakes
4         Donna Ona      Daisy      Barnie

##2)LEFT Join

In [16]:
run('''
    SELECT
        S.Owner_Name,
        S.Dog_Name,
        C.Cat_Name
    FROM
        Dog_Table AS S
        LEFT JOIN Cat_Table AS C on S.Owner_Name = C.Owner_Name
        
    ''')

         Owner_Name   Dog_Name    Cat_Name
0  Michael Martinez  Chewbacca   Mrs. Paws
1    Gilbert Henkel        Max     Mittens
2        May Reeves    Georgie      Clover
3  Elizabeth Minier      Sunny  Sweetcakes
4         Donna Ona      Daisy      Barnie
5      Daniel Abner       Jake
6      Keith Bursey     Muffin
7       Jane Garcia    Admiral
8      Sarah Flores      Bogie
9       David Brace      Fritz

##3) RIGHT Join

In [17]:
run('''
    SELECT
        S.Owner_Name,
        S.Dog_Name,
        C.Cat_Name
    FROM
        Dog_Table AS S
        left JOIN Cat_Table AS C on S.Owner_Name = C.Owner_Name
        
    ''')

         Owner_Name   Dog_Name    Cat_Name
0  Michael Martinez  Chewbacca   Mrs. Paws
1    Gilbert Henkel        Max     Mittens
2        May Reeves    Georgie      Clover
3  Elizabeth Minier      Sunny  Sweetcakes
4         Donna Ona      Daisy      Barnie
5      Daniel Abner       Jake
6      Keith Bursey     Muffin
7       Jane Garcia    Admiral
8      Sarah Flores      Bogie
9       David Brace      Fritz

#Big Join

In [18]:
run('''
    SELECT
        C.make,
        C.model, 
        S.revenue,
        CUST.gender,
        SM.first_name
    FROM
        sales_table S
        JOIN car_table C
        JOIN salesman_table SM
        JOIN cust_table CUST
    WHERE
        S.customer_id = CUST.customer_id
        AND S.model_id = C.model_id
        AND S.salesman_id = SM.id
        AND (C.model in ('Tundra', 'Camry', 'Corolla') OR C.make = 'Subaru')
        AND S.revenue between 17000 and 22000
        AND CUST.gender = 'female' 
        AND SM.first_name NOT IN ('Kathleen', 'Samantha')
    LIMIT 5
    ''')

     make     model  revenue  gender first_name
0  Toyota    Tundra    21222  female     Joseph
1  Subaru   Outback    18671  female      Elton
2  Toyota     Camry    20460  female      Jared
3  Subaru  Forester    17312  female    Matthew
4  Subaru   Outback    19418  female   Claudine

#Operators

In [19]:
run('''
    SELECT
        '$ ' || SUM(S.revenue - C.cogs) total_gross_profit
    FROM
        sales_table S
        JOIN car_table C on S.model_id = C.model_id 
    ''')

  total_gross_profit
0         $ 596814.0

#Group_By

In [26]:
run('''
    SELECT
        C.model AS Car_Model, 
        SUM(S.revenue) AS Total_Revenue
    FROM
        sales_table S
        JOIN car_table C on S.model_id = C.model_id
    GROUP BY
        Car_Model
        LIMIT 5
    ''')

  Car_Model  Total_Revenue
0    Accord         234748
1     Camry         212080
2     Civic         157886
3   Corolla         154880
4  Forester         201083

In [30]:
run('''
    SELECT
        C.model AS Car_Model, 
        MIN(S.revenue) || ' - ' || MAX(S.revenue) AS Min_to_Max_Sale,
        MAX(S.revenue) - MIN(S.revenue) AS Range,
        ROUND(AVG(S.revenue), 2) AS Average_Sale
    FROM
        sales_table S
        JOIN car_table C on S.model_id = C.model_id 
    GROUP BY
        Car_Model
    ORDER BY
        Average_Sale DESC
    ''')

  Car_Model Min_to_Max_Sale  Range  Average_Sale
0    Tundra   20174 - 25938   5764      22859.44
1     Prius   18150 - 23958   5808      21244.14
2   Outback   18671 - 24646   5975      21160.40
3    Accord   17020 - 21441   4421      19562.33
4     Camry   16720 - 21780   5060      19280.00
5  Forester   16646 - 21751   5105      18280.27
6     Civic   13642 - 18008   4366      15788.60
7   Corolla   12640 - 15360   2720      14080.00

#Multi-Group By

In [31]:
run('''
    SELECT
        C.make AS car_caker, 
        payment_type,
        ROUND(AVG(revenue)) as avg_revenue
    FROM
        sales_table S
        JOIN car_table C on S.model_id = C.model_id 
    GROUP BY
        C.Make, 
        payment_type
    ''')

  car_caker payment_type  avg_revenue
0     Honda         cash        17028
1     Honda      finance        19030
2    Subaru         cash        19581
3    Subaru      finance        20363
4    Toyota         cash        20437
5    Toyota      finance        19183

#Having

In [32]:
run('''
    SELECT
        C.Make as Car_Maker, 
        SUM(revenue) as Total_Revenue
    FROM
        sales_table S
        JOIN car_table C on S.model_id = C.model_id
    GROUP BY
        Car_Maker HAVING Total_Revenue > 500000
    ''')

  Car_Maker  Total_Revenue
0    Subaru         518489
1    Toyota        1030129